# OS Basics
cask "rectangle"
brew "zsh"
cask "iterm2"
#cask "google-chrome"
brew "thefuck"
brew "autojump"
cask "1password"

brew "fzf"
cask "viscosity"
brew "tfenv"
brew "tree"
brew "jq"
cask "visual-studio-code"
cask "authy"
brew "vim"
brew "git"
cask "spotify"
cask "skype"
cask "slack"

# Cloud
brew "awscli"
cask "aws-vault"

# Kubernetes
cask "docker"
brew "kubectl"
brew "k9s"

# Experiment
cask "notion"
