# OS Basics
cask "rectangle"
brew "zsh"
cask "iterm2"
cask "brave-browser"
brew "thefuck"
brew "autojump"
cask "1password"
brew "gnupg"
brew "htop"
brew "ipcalc"
brew "telnet"
brew "fzf"
brew "tree"
brew "jq"
brew "vim"
brew "git"
brew "sops"
brew "gh"
brew "gnu-getopt"

# Misc Apps
cask "spotify"
cask "skype"
cask "slack"
cask "zoom"
cask "notion"
cask "visual-studio-code"
cask "viscosity"
cask "authy"


# Infrastructure
brew "tfenv"
tap "alextodicescu/tgenv"
brew "tgenv"

# Cloud
brew "awscli"
cask "aws-vault"

# Kubernetes
cask "docker"
brew "kubectl"
brew "k9s"
brew "aws-iam-authenticator"
brew "helm"
